namespace Monopoly.Model;

public class Chance : ISector
{
    /*
     * Проведите ремонт всей своей собственности, заплатите по 25 за каждый дом, заплатите по 100 за каждый отель
     * Ваш займ на строительство погашен, получите 150
     * Отправляйтесь на ближайшую жд, если объект свободен, вы можете купить его в банке, если он занят, заплатите владельцу двойную ренту, если вы прошли клетку "Вперед" получите 200
     * Выйти из тюрьмы бесплатно, эту карточку можно оставить у себя, обменять или продать
     * Штраф за превышение скорости, заплатите 15
     * Отправляйтесь на ближайшее коммунальное предприятие, если оно свободно, его можно купить у банка, если оно занято, бросьте кубики и заплатите владельцу сумму, равную числу выпавшему на кубиках и умножьте на 10, если вы прошли клетку "Вперед" получите 200
     * Отправляйтесь на улицу полянка, если вы прошли клетку "вперед", получите 200
     * Посетите Рижскую жд, если вы прошли клетку "Вперед", получите 200
     * Банк выплачивает вам дивиденды в размере 50
     * Перейдите на улицу Арбат
     * Вас выбрали председателем совета, заплатите каждому игроку по 50
     * Вернитесь на 3 клетки назад
     * Отправляйтесь на ближайшую жд, если объект свободен, вы можете купить его в банке, если он занят, заплатите владельцу двойную ренту, если вы прошли клетку "Вперед" получите 200
     * Отправляйтесь на площадь Маяковского, если вы прошли клетку "Вперед", получите 200
     * Перейдите на клетку "Вперед", получите 200
     * Отправляйтесь в тюрьму. Отправляясь в тюрьму, не проходя клетку "вперед" не получая 200
     */
}